In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
data1=np.random.randint(3,10,5)
s1=Series(data=data1,index=(['a','b','c','d','e']))
s1

a    7
b    8
c    9
d    7
e    8
dtype: int64

In [10]:
print(s1['c':'e'])
print(s1[-3:])

c    9
d    7
e    8
dtype: int64
c    9
d    7
e    8
dtype: int64

In [19]:
data2=[{'year':'2017','price':'10'},{'year':'2018','price':'20'},{'year':'2019','price':'30'}]
df=DataFrame(data=data2)
df

   year price
0  2017    10
1  2018    20
2  2019    30

In [21]:
data3=np.random.randint(5,15,(5,3))
df_test=DataFrame(data=data3,index=['a','c','e','f','h'],columns=(['one','two','three']))
df_test

   one  two  three
a    6    9     11
c    7    7     10
e   10    7      8
f    9   13     13
h   12    8      6

In [26]:
df_test.loc['a','one']=np.NAN
df_test.loc['c','two']=-99
df_test.loc['c','three']=-99
df_test.loc['a','two']=-100
df_test['four']='test'
df_test

    one  two  three  four
a   NaN -100     11  test
c   7.0  -99    -99  test
e  10.0    7      8  test
f   9.0   13     13  test
h  12.0    8      6  test

In [29]:
df_change=df_test.reindex(['a','b','c','d','e','f','g','h'])
df_change

    one    two  three  four
a   NaN -100.0   11.0  test
b   NaN    NaN    NaN   NaN
c   7.0  -99.0  -99.0  test
d   NaN    NaN    NaN   NaN
e  10.0    7.0    8.0  test
f   9.0   13.0   13.0  test
g   NaN    NaN    NaN   NaN
h  12.0    8.0    6.0  test

In [39]:
print(df_change.dropna())

    one   two  three  four
c   7.0 -99.0  -99.0  test
e  10.0   7.0    8.0  test
f   9.0  13.0   13.0  test
h  12.0   8.0    6.0  test

In [40]:
print(df_change.dropna(how='all'))

    one    two  three  four
a   NaN -100.0   11.0  test
c   7.0  -99.0  -99.0  test
e  10.0    7.0    8.0  test
f   9.0   13.0   13.0  test
h  12.0    8.0    6.0  test

In [41]:
print(df_change.fillna(0))

    one    two  three  four
a   0.0 -100.0   11.0  test
b   0.0    0.0    0.0     0
c   7.0  -99.0  -99.0  test
d   0.0    0.0    0.0     0
e  10.0    7.0    8.0  test
f   9.0   13.0   13.0  test
g   0.0    0.0    0.0     0
h  12.0    8.0    6.0  test

In [42]:
df_change.drop_duplicates()

    one    two  three  four
a   NaN -100.0   11.0  test
b   NaN    NaN    NaN   NaN
c   7.0  -99.0  -99.0  test
e  10.0    7.0    8.0  test
f   9.0   13.0   13.0  test
h  12.0    8.0    6.0  test